{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "name" : "reshape_11",
      "bottom" : "strokeSeq",
      "dst_n" : 0,
      "mode" : 0,
      "dst_seq" : 75,
      "dst_k" : 3,
      "weights" : {

      },
      "top" : "reshape_11_output",
      "dst_h" : 1,
      "dst_w" : 1,
      "type" : "reshape"
    },
    {
      "axis_h" : 1,
      "axis_w" : 4,
      "axis_k" : 2,
      "bottom" : "reshape_11_output",
      "axis_n" : 3,
      "axis_seq" : 0,
      "weights" : {

      },
      "top" : "reshape_11_permute_conv1d_0_output",
      "type" : "transpose",
      "name" : "reshape_11_permute_conv1d_0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1d_0_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "conv1d_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "reshape_11_permute_conv1d_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1d_1_output",
      "blob_weights" : 7,
      "K" : 48,
      "blob_biases" : 5,
      "name" : "conv1d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv1d_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1d_2_output",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "name" : "conv1d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "conv1d_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1d_3_output",
      "blob_weights" : 15,
      "K" : 96,
      "blob_biases" : 13,
      "name" : "conv1d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv1d_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "conv1d_3_output",
      "axis_w" : 4,
      "axis_h" : 1,
      "axis_k" : 2,
      "axis_n" : 3,
      "hint_fallback_from_metal" : 1,
      "axis_seq" : 0,
      "weights" : {

      },
      "top" : "conv1d_3_permute_lstm_0_output",
      "type" : "transpose",
      "name" : "conv1d_3_permute_lstm_0"
    },
    {
      "input_size" : 128,
      "arch" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "hidden_size" : 128,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "lstm_forget_bias" : 1,
      "coupled_input_forget" : 0,
      "bias_vector_flag" : 1,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 50000,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_second_beta" : 1,
      "type" : "rnn_arch",
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 17,
        "b" : 25,
        "b_reverse" : 27,
        "W_x_reverse" : 23,
        "W_x" : 21,
        "W_h_reverse" : 19
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "lstm_0",
      "top" : "lstm_0_output,lstm_0_h_out,lstm_0_c_out,lstm_0_h_out_rev,lstm_0_c_out_rev",
      "alpha" : 1,
      "hint_fallback_from_metal" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "nonlinearity_bidir_alpha" : 1,
      "internal_nonlinearity_bidir_type" : 3,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 3,
      "bottom" : "conv1d_3_permute_lstm_0_output,lstm_0_h_in,lstm_0_c_in,lstm_0_h_in_rev,lstm_0_c_in_rev",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "input_size" : 256,
      "arch" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "hidden_size" : 128,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "lstm_forget_bias" : 1,
      "coupled_input_forget" : 0,
      "bias_vector_flag" : 1,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 50000,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_second_beta" : 1,
      "type" : "rnn_arch",
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 29,
        "b" : 37,
        "b_reverse" : 39,
        "W_x_reverse" : 35,
        "W_x" : 33,
        "W_h_reverse" : 31
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "lstm_1",
      "top" : "lstm_1_output,lstm_1_h_out,lstm_1_c_out,lstm_1_h_out_rev,lstm_1_c_out_rev",
      "alpha" : 1,
      "hint_fallback_from_metal" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "nonlinearity_bidir_alpha" : 1,
      "internal_nonlinearity_bidir_type" : 3,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 3,
      "bottom" : "lstm_0_output,lstm_1_h_in,lstm_1_c_in,lstm_1_h_in_rev,lstm_1_c_in_rev",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "input_size" : 256,
      "arch" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "hidden_size" : 128,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "lstm_forget_bias" : 1,
      "coupled_input_forget" : 0,
      "bias_vector_flag" : 1,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "cell_clip_threshold" : 50000,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_second_beta" : 1,
      "type" : "rnn_arch",
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 41,
        "b" : 49,
        "b_reverse" : 51,
        "W_x_reverse" : 47,
        "W_x" : 45,
        "W_h_reverse" : 43
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "lstm_2",
      "top" : "lstm_2_output,lstm_2_h_out,lstm_2_c_out,lstm_2_h_out_rev,lstm_2_c_out_rev",
      "alpha" : 1,
      "hint_fallback_from_metal" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "nonlinearity_bidir_alpha" : 1,
      "internal_nonlinearity_bidir_type" : 3,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 3,
      "bottom" : "lstm_1_output,lstm_2_h_in,lstm_2_c_in,lstm_2_h_in_rev,lstm_2_c_in_rev",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "bottom" : "lstm_2_output",
      "axis_w" : 0,
      "axis_h" : 4,
      "axis_k" : 2,
      "axis_n" : 3,
      "hint_fallback_from_metal" : 1,
      "axis_seq" : 1,
      "weights" : {

      },
      "top" : "flatten_5_output__permute__",
      "type" : "transpose",
      "name" : "flatten_5__permute__"
    },
    {
      "bottom" : "flatten_5_output__permute__",
      "weights" : {

      },
      "mode" : 1,
      "hint_fallback_from_metal" : 1,
      "top" : "flatten_5_output",
      "type" : "flatten",
      "name" : "flatten_5"
    },
    {
      "nB" : 19200,
      "top" : "dense_5_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 172,
      "blob_weights" : 55,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten_5_output",
      "blob_biases" : 53,
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "dense_5",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "classLabelProbs",
      "type" : "softmax",
      "name" : "dense_5__activation__",
      "bottom" : "dense_5_output"
    }
  ]
}