{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_13__activation___output",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "stride_x" : 3,
      "name" : "conv2d_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 3,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_13__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_13",
      "top" : "max_pooling2d_13_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_14__activation___output",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "conv2d_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_13_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_14__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_14",
      "top" : "max_pooling2d_14_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_15__activation___output",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "conv2d_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pooling2d_14_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_15__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_15",
      "top" : "max_pooling2d_15_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_16__activation___output",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "conv2d_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "max_pooling2d_15_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_16__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_16",
      "top" : "max_pooling2d_16_output"
    },
    {
      "mode" : 1,
      "weights" : {

      },
      "top" : "flatten_4_output",
      "type" : "flatten",
      "name" : "flatten_4",
      "bottom" : "max_pooling2d_16_output"
    },
    {
      "nB" : 3200,
      "top" : "classActivations",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "flatten_4_output",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "name" : "dense_2_512",
      "has_prelu" : 0
    }
  ]
}